### Fisher Score- Chisquare Test For Feature Selection
####   Compute chi-squared stats between each non-negative feature and class.

This score should be used to evaluate categorical variables in a classification task.
This score can be used to select the n_features features with the highest values for the test chi-squared statistic from X, which must contain only non-negative features such as booleans or frequencies (e.g., term counts in document classification), relative to the classes.

Recall that the chi-square test measures dependence between stochastic variables, so using this function “weeds out” the features that are the most likely to be independent of class and therefore irrelevant for classification. The Chi Square statistic is commonly used for testing relationships between categorical variables.

It compares the observed distribution of the different classes of target Y among the different categories of the feature, against the expected distribution of the target classes, regardless of the feature categories.

In [1]:
import seaborn as sns
df = sns.load_dataset('titanic')

In [2]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
## ['sex','embarked','alone','pclass','Survived']
df = df[['sex','embarked','alone','pclass','survived']]
df.head()

      sex embarked  alone  pclass  survived
0    male        S  False       3         0
1  female        C  False       1         1
2  female        S   True       3         1
3  female        S  False       1         1
4    male        S   True       3         0

In [5]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [6]:
### Label Encoding Performing on columns
df['sex'] = encoder.fit_transform(df['sex'])
df['embarked'] = encoder.fit_transform(df['embarked'])
df['alone'] = encoder.fit_transform(df['alone'])
df['pclass'] = encoder.fit_transform(df['pclass'])

In [7]:
df.head()

   sex  embarked  alone  pclass  survived
0    1         2      0       2         0
1    0         0      0       0         1
2    0         2      1       2         1
3    0         2      0       0         1
4    1         2      1       2         0

In [8]:
## train test split is usually done to avoid overfitting
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(df.drop('survived',axis=1),df['survived'],test_size=0.3, random_state=42)

X_train.shape, X_test.shape

((623, 4), (268, 4))

In [9]:
X_train.head()

     sex  embarked  alone  pclass
445    1         2      0       0
650    1         2      1       2
172    0         2      0       2
450    1         2      0       1
314    1         2      0       1

In [10]:
## Performing chi^2 test

## chi^2 returns 2 values
## Fscore and the pvalue

from sklearn.feature_selection import chi2
f_p_values = chi2(X_train,y_train)

In [11]:
f_p_values
# First values are f-score (1st row)
# Second values are p values (2nd row)

(array([60.41964418,  7.92931297,  8.35778435, 30.38083393]),
 array([7.66442567e-15, 4.86402622e-03, 3.84038546e-03, 3.55018608e-08]))

In [12]:
import pandas as pd
p_values = pd.Series(f_p_values[1])
p_values.index = X_train.columns
p_values

sex         7.664426e-15
embarked    4.864026e-03
alone       3.840385e-03
pclass      3.550186e-08
dtype: float64

In [13]:
p_values.sort_index(ascending=False)

sex         7.664426e-15
pclass      3.550186e-08
embarked    4.864026e-03
alone       3.840385e-03
dtype: float64

##### Observation
sex column is the most importany column when compare to the output feature Survived